tutorials/untested/rashigsV9/constant/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  4.1                                   | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 2.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 location 	 "constant"; 
 	 object 	 porosityProperties; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

// inWallPorosity
// {
// 	type		DarcyForchheimer;
// 	active		yes;
// 	cellZone	inWallPorosity;

// 	DarcyForchheimerCoeffs
// 	{
// 		d	(2.000000e+12 2.000000e+12 2.000000e+12);
// 		f	(0.000000e+00 0.000000e+00 0.000000e+00);

// 		coordinateSystem
// 		{
// 			type		cartesian;
// 			origin		(0 0 0);
// 			coordinateRotation
// 			{
// 				type	axesRotation;
// 				e1		(1 0 0);
// 				e2		(0 0 1);
// 			}
// 		}
// 	}
// }
coatZone
{
	type		DarcyForchheimer;
	active		yes;
	// cellZone	coating;
	cellZone	coatZone;

	DarcyForchheimerCoeffs
	{
		d	(3.623188e+14 3.623188e+14 3.623188e+14);
		dPerm dPerm [0 -2 0 0 0 0 0]	(3.623188e+14 3.623188e+14 3.623188e+14);
		f	(0.000000e+00 0.000000e+00 0.000000e+00);

		coordinateSystem
		{
			type		cartesian;
			origin		(0 0 0);
			coordinateRotation
			{
				type	axesRotation;
				e1		(1 0 0);
				e2		(0 0 1);
			}
		}
	}
}
// ************************************************************************* //

