tutorials/untested/rashigsV9/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

//~ nu	[0 2 -1 0 0 0 0]	0.00004343;

//~ species (CO O2 NO CO2 N2 N2O);
species (CO N2);
//~ species (NO N2 N2O CO2 CO O2);

diffusionType Fick;

zones (coatZone);

ref
{
    // -- reference diffusion volume in m3mol-1 for diffusivity computations (see Fuller)
    sigmaV      16.2;           
    
    molM        28.01e-3;    

    // -- thermal conductivity polynom coeficients for reference gas Wm-1K-1
    // -- kappaGas = kappaA+kappaB*T+kappaC*Foam::pow(T,2)+kappaD*Foam::pow(T,3)
    kappaA  kappaA  [1 1 -3 -1 0 0 0] 0.3918e-3;                             
    kappaB  kappaB  [1 1 -3 -2 0 0 0] 0.9814e-4;                              
    kappaC  kappaC  [1 1 -3 -3 0 0 0] -5.0660e-8;                             
    kappaD  kappaD  [1 1 -3 -4 0 0 0] 1.503479e-11;    

    //specific heat of the substrate in Jkg-1K-1
    // Cp	    Cp 	    [0  2  -2   -1  0 0 0]  520.65;                       
}

N2
{
    // -- reference diffusion volume in m3mol-1 for diffusivity computations (see Fuller)
    sigmaV      16.2;           
    
    molM        28.e-3;   
    nuVec       (0.0);                     
}

CO
{
    // for diffusivity computations
    sigmaV      41.0;                                                   //diffusion volume in m3mol-1
    // molM        28.0e-3;                                                //molar mass in kgmol-1
    molM        28.1e-3;                                                //molar mass in kgmol-1

    
    //---
    minForGrad  1e-36;
    nuVec       (-1.0);                                                 //row of the stoechiometric matrix
    alphaVec    (1.0);                                                  //powers in different reactions kinetics
}



isOnWallCoat
{//field with the location of the coating - 1 -> coating - 0 -> free
    type        field;
}
isInWallCoat
{//field with the location of the coating - 1 -> coating - 0 -> free
    type        field;
}

coatZone    
{
    porEps  porEps  [0 0 0 0 0 0 0] 0.47;                                //coating porosity
    constr  constr  [0 0 0 0 0 0 0] 1.0;                                //constrictivity   //for elimination set to 1.0
    tort    tort    [0 0 0 0 0 0 0] 5.0;                               //tortuosity
    dP	dP	[0 1 0 0 0 0 0] 5.0e-9;										//Mean pore size of on-wall catalytic coating (m) -- XPF
    kappa  kappa  [1 1 -3 -1 0 0 0] 5.0;                              //thermal conductivity of coating in Wm-1K-1
    Cp      Cp      [0 2 -2 -1 0 0 0] 962;                            //specific heat of the substrate in Jkg-1K-1
    rho     rho     [1 -3 0 0 0 0 0] 1000.0;                            //efective density in kgm-3 (assumed constant)
    coatFrac     coatFrac     [0 0 0 0 0 0 0] 0.0;                            //coating fraction in zone
    kH    kH    [1 0 -3 -1 0 0 0]         200;                                          //heat transfer coefficient
    a    a   [0 -1 0 0 0 0 0]         40000;                                          //specific area
}

// Deff = D*porEps*constr/tort - estimate for the effective diffusivity in coating
// Deff - random pore model N. Wakao, J.M. Smith, Chemical Engineering Science, 17 (1962)
// D - N. Wakao, J.M. Smith, Chemical Engineering Science, 17 (1962)


genProps
{
    univR   univR   [1  2 -2 -1 -1 0 0]  8.31446261815324;
}


// ************************************************************************* //
