tutorials/untested/rashigsV9/0.org/CO
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      CO;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;
//~ internalField   uniform 0.01;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.07;
    }

    "(outlet|walls|inletCyl)"
    {
        type        zeroGradient;
    }
    cylinder
    {
        type            codedMixed;
        refValue        uniform 0;
        refGradient        uniform 0;
        valueFraction    uniform 0;        //1 - pure Neumann, 0 - pure Dirichlet
        
        name            customBC;        //The name of the dynamically created BC
        
        code
        #{
                    
            const volScalarField& CO = this->db().lookupObject<volScalarField>("CO");

            const volScalarField& rho = this->db().lookupObject<volScalarField>("rho");
            surfaceScalarField sngradCTot = fvc::snGrad(rho);



            surfaceScalarField e_feld
            (
                IOobject
                (
                    "e_feld",
                    db().time().timePath(),
                    db(),
                    IOobject::NO_READ,
                    IOobject::AUTO_WRITE
                ),
                -fvc::interpolate(CO)*sngradCTot/fvc::interpolate(rho)
            );

//            Info << min(e_feld) << " " << max(e_feld)<<endl;
            this->refGrad() =  e_feld.boundaryField()[patch().index()];
        #};
         
        codeInclude
        #{
            #include "fvCFD.H"
        #};

        codeOptions
        #{
            -I$(LIB_SRC)/finiteVolume/lnInclude \
            -I$(LIB_SRC)/meshTools/lnInclude \
            -I$(LIB_SRC)/sampling/lnInclude
        #};
    }

}

// ************************************************************************* //
